       program-id. CONVERT as "CONVERT".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
       100-PERFOR.
           DISPLAY "A".

           goback.

       end program CONVERT.
