      *Skeleton COBOL Copybook
       01  INVENT-RECORD-IN.
           05 PART-NUMBER-IN    PIC 9(7)       VALUE ZERO.
           05 PART-NAME-IN      PIC X(20)      VALUE SPACES.
           05 QUANTITY-IN       PIC 9(4)       VALUE ZERO.
           05 UNIT-PRICE-IN     PIC 9(4)       VALUE ZERO.
           05 REORDER-POINT-IN  PIC 9(4)       VALUE ZERO.
           05 SUPPLIER-CODE-INV PIC X(5)       VALUE SPACES.


