       IDENTIFICATION DIVISION.
       PROGRAM-ID. REORDER as "REORDER".
       AUTHOR.     FANG.

      *IDENTIFY FILE IN AND FILE OUT 
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENT-FILE-IN
               ASSIGN TO"D:\COBOL\INVFILE3.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT SUPPLIER-FILE-IN
               ASSIGN TO"D:\COBOL\SUPPLIERFILE.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT  REORDER-REPORT-OUT
               ASSIGN TO"D:\COBOL\REORDERFILE.TXT"
               ORGANIZATION IS LINE SEQUENTIAL. 


      *FIELDS DECLARATION AND DEFINITION             
       DATA DIVISION.
       FILE SECTION.
       FD INVENT-FILE-IN.
       01 INVENTORY-RECORD.
           05 PART-NUM-IN          PIC 9(7)    VALUE ZEROS.
           05 PART-NAME-IN         PIC X(20)   VALUE SPACES.
           05 QTY-ON-HAND-IN       PIC 9(4)    VALUE ZEROS.        
           05 UNIT-PRICE-IN        PIC 9(4)    VALUE ZEROS.
           05 RE-ORDER-POINT-IN    PIC 9(4)    VALUE ZEROS.
           05 SUPPLIER-CODE-IN     PIC X(5)    VALUE SPACES.

       FD REORDER-REPORT-OUT.
       01 REORDER-REPORT-DATA     PIC X(70).   

       FD SUPPLIER-FILE-IN.
       01 SUPPLIER-RECORD-IN.
           05 SUPPLIER-CODE-SEARCH      PIC X(5)    VALUE SPACES.
           05 SUPPLIER-NAME-SEARCH      PIC X(20)   VALUE SPACES.



      *LOCAL DATA DECLARATION AND DEFINITION
       WORKING-STORAGE SECTION.

       01 REORDER-COLUMN-NAME.
           05 FILLER PIC X(15)   VALUE"INVENTORY-NUM".
           05 FILLER PIC X(15)   VALUE"INVENTORY-NAME".
           05 FILLER PIC X(25)   VALUE"QUANTITY-ON-HAND".
           05 FILLER PIC X(20)   VALUE"SUPPLIER-NAME".

       01 FLAGS.
           05 EOF-INVENT               PIC X(3)    VALUE "NO".
           05 EOF-SUPPLIER             PIC X(3)    VALUE "NO".
           05 EOF-QUERY                PIC X(3)    VALUE "NO".
           05 SUPPLIER-CODE-IN-SEARCH  PIC X(5)    VALUE SPACES.

       01 REORDER-REPORT-OUT-RECORD.
           05 INVENTORY-NUM-OUT        PIC 9(7)    VALUE ZEROS.
           05 FILLER                   PIC X(6)    VALUE SPACES.
           05 INVENTORY-NAME-OUT       PIC X(20)   VALUE ZEROS.
           05 FILLER                   PIC X(2)    VALUE SPACES.
           05 QTY-ON-HAND-OUT          PIC 9(4)    VALUE ZEROS.
           05 FILLER                   PIC X(12)   VALUE SPACES.
           05 SUPPLIER-NAME-OUT        PIC X(20)   VALUE SPACES.

      * TABLE DATA DECLARATION AND DEFINITION    
       01 SUPPLIER-TABLE.
           05 SUPPLIER-RECORDS OCCURS 7 TIMES
               ASCENDING KEY IS SUPPLIER-CODE
               INDEXED BY SUB.
               10  SUPPLIER-CODE    PIC X(5).
               10  SUPPLIER-NAME    PIC X(20).    


      * PROGRAM LOGIC
       PROCEDURE DIVISION.
      * PROGRAM LOGIC CONTROL CENTER, THE HIGHEST LEVEL
       100-CREATE-INVENT-REORDER-REPORT.
           PERFORM 300-INIT-REORDER-REPORT.
           PERFORM 300-SEARCH-INVENT-RECORD-WRITE-REORDER-RECORD        
               UNTIL EOF-INVENT = "YES".
           PERFORM 300-TERMINATE-REORDER-REPORT.           
           EXIT PROGRAM.  

      * SECOND LEVEL OF LOGIC CONTROL
      * OPEN READ INVENT DATA.LOAD SUPPLIER TABLE. WRITE COLUMN HEADERS.
      * OPEN FILES AND READ INVENTORY RECORD

       300-INIT-REORDER-REPORT.
           PERFORM 700-OPEN-ALL-FILES.
           PERFORM 700-LOAD-SUPPLIER-TABLE.

      * READ INVENT REPORT      
       300-SEARCH-INVENT-RECORD-WRITE-REORDER-RECORD.                   
           PERFORM 700-SEARCH-INV-RECORD-WRITE-REORDER-RECORD.

      *TERMINATE REORDER REPORT PROCESS 
       300-TERMINATE-REORDER-REPORT.
       PERFORM 700-CLOSE-ALL-FILES.

      *PROCEDURE THAT OPENS ALL FILES
       700-OPEN-ALL-FILES.
           OPEN INPUT  INVENT-FILE-IN.
           OPEN INPUT  SUPPLIER-FILE-IN.
           OPEN OUTPUT REORDER-REPORT-OUT.

      * LOAD SUPPLIER TABLE FROM EXTERNAL SUPPLIER FILE UNTIL REACH 
      * THE END OF FILE OR INDEX IS GREATER THAN 7
      * LOAD THE DATA INTO TABLE

       700-LOAD-SUPPLIER-TABLE.
           PERFORM VARYING SUB FROM 1 BY 1
               UNTIL EOF-SUPPLIER = "YES"
               OR SUB > 7     

           READ SUPPLIER-FILE-IN INTO SUPPLIER-RECORDS(SUB)
               AT END MOVE "YES" TO EOF-SUPPLIER
               NOT AT END
                   MOVE SUPPLIER-CODE-SEARCH 
                       TO   SUPPLIER-CODE(SUB)
           MOVE SUPPLIER-NAME-SEARCH
               TO   SUPPLIER-NAME(SUB).

      * READ INVENTORY RECORD IN
      * IF REORDER CONDITION SATISFIED
      * MOVE DATA TO OUTPUT RECORD
      * SEARCH THE SUPPLY TABLE
      * UNTIL END OF FILD REACHED OR INDEX GREATER THAN 7
      * WRITE THE REORDER REPORT RECORD
       700-SEARCH-INV-RECORD-WRITE-REORDER-RECORD.               
           READ INVENT-FILE-IN
               AT END MOVE "YES" TO EOF-INVENT
           IF QTY-ON-HAND-IN < RE-ORDER-POINT-IN 
               MOVE PART-NUM-IN       TO INVENTORY-NUM-OUT       
               MOVE PART-NAME-IN      TO INVENTORY-NAME-OUT
               MOVE QTY-ON-HAND-IN    TO QTY-ON-HAND-OUT
               MOVE SUPPLIER-CODE-IN  TO SUPPLIER-CODE-IN-SEARCH        
               MOVE "NO" TO EOF-SUPPLIER 

           PERFORM 1000-SEARCH-SUPPLIER-TABLE
               VARYING SUB FROM 1 BY 1
               UNTIL EOF-SUPPLIER = "YES"
               OR SUB > 7
           MOVE "NO" TO EOF-SUPPLIER  

           PERFORM 1000-WRITE-REORDER-HEADLINE-RECORD.       


      *PROCEDURE TO SEARCH THE SUPPLIER TABLE 
      *UNTIL RECORD FOUND 
      *WRITE SUPPLIER NAME OUT
       1000-SEARCH-SUPPLIER-TABLE. 
           IF SUPPLIER-CODE(SUB) = SUPPLIER-CODE-IN-SEARCH
               MOVE SUPPLIER-NAME(SUB) 
                   TO   SUPPLIER-NAME-OUT               
               MOVE "YES" TO EOF-QUERY.

      *WRITE REORDER RECORDER HEADER AND DETAIL        
       1000-WRITE-REORDER-HEADLINE-RECORD.
           WRITE REORDER-REPORT-DATA 
               FROM REORDER-COLUMN-NAME.

           WRITE REORDER-REPORT-DATA 
               FROM REORDER-REPORT-OUT-RECORD.

      *CLOSE ALL FILES

       700-CLOSE-ALL-FILES.
           CLOSE INVENT-FILE-IN.
           CLOSE SUPPLIER-FILE-IN.
           CLOSE REORDER-REPORT-OUT. 


       end program REORDER.








