       program-id. REPORT as "REPORT".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program REPORT.
